tests/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="warning">
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="localhost" port="3000" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="2" unit="minute">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="2" unit="minute">
      <users arrivalrate="50" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <option name="file_server" id="taxa" value="./species.csv"/>
    <option type="ts_http" name="user_agent">
      <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
      <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="home page" weight="10" type="ts_http">
      <request>
        <http url="/" method="GET"></http>
      </request>
    </session>
    <session name="obeservation map" weight="10" type="ts_http">
      <request>
        <http url="/observation/map" method="GET"></http>
      </request>
    </session>
    <session name="observation list" weight="10" type="ts_http">
      <request>
        <http url="/observation/list" method="GET"></http>
      </request>
    </session>
    <session name="observation images" weight="10" type="ts_http">
      <request>
        <http url="/observation/images" method="GET"></http>
      </request>
    </session>
    <session name="observation species" weight="10" type="ts_http">
      <request>
        <http url="/observation/species" method="GET"></http>
      </request>
    </session>
    <session name="observation stats" weight="10" type="ts_http">
      <request>
        <http url="/observation/stats" method="GET"></http>
      </request>
    </session>
    <session name="notebook" weight="10" type="ts_http">
      <request>
        <http url="/vihko" method="GET"></http>
      </request>
    </session>
    <session name="taxon" weight="10" type="ts_http">
      <setdynvars sourcetype="file" fileid="taxa" delimiter=";" order="random">
        <var name="taxon"/>
      </setdynvars>
      <request subst="true">
        <http url="/taxon/%%_taxon%%" method="GET"></http>
      </request>
    </session>
  </sessions>
</tsung>